espressif/esp-idf/components/soc/esp32p4/include/soc/hp_sys_clkrst_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: clk_en */
/** Type of clk_en0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_clk_en : R/W; bitpos: [0]; default: 1;
         *  Reserved
         */
        uint32_t reg_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_clkrst_clk_en0_reg_t;


/** Group: root_clk_ctrl */
/** Type of root_clk_ctrl0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_cpuicm_delay_num : R/W; bitpos: [3:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_cpuicm_delay_num:4;
        /** reg_soc_clk_div_update : WT; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_soc_clk_div_update:1;
        /** reg_cpu_clk_div_num : R/W; bitpos: [12:5]; default: 0;
         *  Reserved
         */
        uint32_t reg_cpu_clk_div_num:8;
        /** reg_cpu_clk_div_numerator : R/W; bitpos: [20:13]; default: 0;
         *  Reserved
         */
        uint32_t reg_cpu_clk_div_numerator:8;
        /** reg_cpu_clk_div_denominator : R/W; bitpos: [28:21]; default: 0;
         *  Reserved
         */
        uint32_t reg_cpu_clk_div_denominator:8;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} hp_sys_clkrst_root_clk_ctrl0_reg_t;

/** Type of root_clk_ctrl1 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_mem_clk_div_num : R/W; bitpos: [7:0]; default: 1;
         *  Reserved
         */
        uint32_t reg_mem_clk_div_num:8;
        /** reg_mem_clk_div_numerator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_mem_clk_div_numerator:8;
        /** reg_mem_clk_div_denominator : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_mem_clk_div_denominator:8;
        /** reg_sys_clk_div_num : R/W; bitpos: [31:24]; default: 0;
         *  Reserved
         */
        uint32_t reg_sys_clk_div_num:8;
    };
    uint32_t val;
} hp_sys_clkrst_root_clk_ctrl1_reg_t;

/** Type of root_clk_ctrl2 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_sys_clk_div_numerator : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_sys_clk_div_numerator:8;
        /** reg_sys_clk_div_denominator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_sys_clk_div_denominator:8;
        /** reg_apb_clk_div_num : R/W; bitpos: [23:16]; default: 1;
         *  Reserved
         */
        uint32_t reg_apb_clk_div_num:8;
        /** reg_apb_clk_div_numerator : R/W; bitpos: [31:24]; default: 0;
         *  Reserved
         */
        uint32_t reg_apb_clk_div_numerator:8;
    };
    uint32_t val;
} hp_sys_clkrst_root_clk_ctrl2_reg_t;

/** Type of root_clk_ctrl3 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_apb_clk_div_denominator : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_apb_clk_div_denominator:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_sys_clkrst_root_clk_ctrl3_reg_t;


/** Group: soc_clk_ctrl */
/** Type of soc_clk_ctrl0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_core0_clic_clk_en : R/W; bitpos: [0]; default: 1;
         *  Reserved
         */
        uint32_t reg_core0_clic_clk_en:1;
        /** reg_core1_clic_clk_en : R/W; bitpos: [1]; default: 1;
         *  Reserved
         */
        uint32_t reg_core1_clic_clk_en:1;
        /** reg_misc_cpu_clk_en : R/W; bitpos: [2]; default: 1;
         *  Reserved
         */
        uint32_t reg_misc_cpu_clk_en:1;
        /** reg_core0_cpu_clk_en : R/W; bitpos: [3]; default: 1;
         *  Reserved
         */
        uint32_t reg_core0_cpu_clk_en:1;
        /** reg_core1_cpu_clk_en : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_core1_cpu_clk_en:1;
        /** reg_tcm_cpu_clk_en : R/W; bitpos: [5]; default: 1;
         *  Reserved
         */
        uint32_t reg_tcm_cpu_clk_en:1;
        /** reg_busmon_cpu_clk_en : R/W; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t reg_busmon_cpu_clk_en:1;
        /** reg_l1cache_cpu_clk_en : R/W; bitpos: [7]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_cpu_clk_en:1;
        /** reg_l1cache_d_cpu_clk_en : R/W; bitpos: [8]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_d_cpu_clk_en:1;
        /** reg_l1cache_i0_cpu_clk_en : R/W; bitpos: [9]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_i0_cpu_clk_en:1;
        /** reg_l1cache_i1_cpu_clk_en : R/W; bitpos: [10]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_i1_cpu_clk_en:1;
        /** reg_trace_cpu_clk_en : R/W; bitpos: [11]; default: 0;
         *  Reserved
         */
        uint32_t reg_trace_cpu_clk_en:1;
        /** reg_icm_cpu_clk_en : R/W; bitpos: [12]; default: 1;
         *  Reserved
         */
        uint32_t reg_icm_cpu_clk_en:1;
        /** reg_gdma_cpu_clk_en : R/W; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t reg_gdma_cpu_clk_en:1;
        /** reg_vpu_cpu_clk_en : R/W; bitpos: [14]; default: 0;
         *  Reserved
         */
        uint32_t reg_vpu_cpu_clk_en:1;
        /** reg_l1cache_mem_clk_en : R/W; bitpos: [15]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_mem_clk_en:1;
        /** reg_l1cache_d_mem_clk_en : R/W; bitpos: [16]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_d_mem_clk_en:1;
        /** reg_l1cache_i0_mem_clk_en : R/W; bitpos: [17]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_i0_mem_clk_en:1;
        /** reg_l1cache_i1_mem_clk_en : R/W; bitpos: [18]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_i1_mem_clk_en:1;
        /** reg_l2cache_mem_clk_en : R/W; bitpos: [19]; default: 1;
         *  Reserved
         */
        uint32_t reg_l2cache_mem_clk_en:1;
        /** reg_l2mem_mem_clk_en : R/W; bitpos: [20]; default: 1;
         *  Reserved
         */
        uint32_t reg_l2mem_mem_clk_en:1;
        /** reg_l2memmon_mem_clk_en : R/W; bitpos: [21]; default: 0;
         *  Reserved
         */
        uint32_t reg_l2memmon_mem_clk_en:1;
        /** reg_icm_mem_clk_en : R/W; bitpos: [22]; default: 1;
         *  Reserved
         */
        uint32_t reg_icm_mem_clk_en:1;
        /** reg_misc_sys_clk_en : R/W; bitpos: [23]; default: 1;
         *  Reserved
         */
        uint32_t reg_misc_sys_clk_en:1;
        /** reg_trace_sys_clk_en : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_trace_sys_clk_en:1;
        /** reg_l2cache_sys_clk_en : R/W; bitpos: [25]; default: 1;
         *  Reserved
         */
        uint32_t reg_l2cache_sys_clk_en:1;
        /** reg_l2mem_sys_clk_en : R/W; bitpos: [26]; default: 1;
         *  Reserved
         */
        uint32_t reg_l2mem_sys_clk_en:1;
        /** reg_l2memmon_sys_clk_en : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_l2memmon_sys_clk_en:1;
        /** reg_tcmmon_sys_clk_en : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_tcmmon_sys_clk_en:1;
        /** reg_icm_sys_clk_en : R/W; bitpos: [29]; default: 1;
         *  Reserved
         */
        uint32_t reg_icm_sys_clk_en:1;
        /** reg_flash_sys_clk_en : R/W; bitpos: [30]; default: 1;
         *  Reserved
         */
        uint32_t reg_flash_sys_clk_en:1;
        /** reg_psram_sys_clk_en : R/W; bitpos: [31]; default: 1;
         *  Reserved
         */
        uint32_t reg_psram_sys_clk_en:1;
    };
    uint32_t val;
} hp_sys_clkrst_soc_clk_ctrl0_reg_t;

/** Type of soc_clk_ctrl1 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpspi2_sys_clk_en : R/W; bitpos: [0]; default: 1;
         *  Reserved
         */
        uint32_t reg_gpspi2_sys_clk_en:1;
        /** reg_gpspi3_sys_clk_en : R/W; bitpos: [1]; default: 1;
         *  Reserved
         */
        uint32_t reg_gpspi3_sys_clk_en:1;
        /** reg_regdma_sys_clk_en : R/W; bitpos: [2]; default: 1;
         *  Reserved
         */
        uint32_t reg_regdma_sys_clk_en:1;
        /** reg_ahb_pdma_sys_clk_en : R/W; bitpos: [3]; default: 1;
         *  Reserved
         */
        uint32_t reg_ahb_pdma_sys_clk_en:1;
        /** reg_axi_pdma_sys_clk_en : R/W; bitpos: [4]; default: 1;
         *  Reserved
         */
        uint32_t reg_axi_pdma_sys_clk_en:1;
        /** reg_gdma_sys_clk_en : R/W; bitpos: [5]; default: 0;
         *  Reserved
         */
        uint32_t reg_gdma_sys_clk_en:1;
        /** reg_dma2d_sys_clk_en : R/W; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t reg_dma2d_sys_clk_en:1;
        /** reg_vpu_sys_clk_en : R/W; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t reg_vpu_sys_clk_en:1;
        /** reg_jpeg_sys_clk_en : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_jpeg_sys_clk_en:1;
        /** reg_ppa_sys_clk_en : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_ppa_sys_clk_en:1;
        /** reg_csi_brg_sys_clk_en : R/W; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t reg_csi_brg_sys_clk_en:1;
        /** reg_csi_host_sys_clk_en : R/W; bitpos: [11]; default: 0;
         *  Reserved
         */
        uint32_t reg_csi_host_sys_clk_en:1;
        /** reg_dsi_sys_clk_en : R/W; bitpos: [12]; default: 0;
         *  Reserved
         */
        uint32_t reg_dsi_sys_clk_en:1;
        /** reg_emac_sys_clk_en : R/W; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_sys_clk_en:1;
        /** reg_sdmmc_sys_clk_en : R/W; bitpos: [14]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdmmc_sys_clk_en:1;
        /** reg_usb_otg11_sys_clk_en : R/W; bitpos: [15]; default: 1;
         *  Reserved
         */
        uint32_t reg_usb_otg11_sys_clk_en:1;
        /** reg_usb_otg20_sys_clk_en : R/W; bitpos: [16]; default: 1;
         *  Reserved
         */
        uint32_t reg_usb_otg20_sys_clk_en:1;
        /** reg_uhci_sys_clk_en : R/W; bitpos: [17]; default: 1;
         *  Reserved
         */
        uint32_t reg_uhci_sys_clk_en:1;
        /** reg_uart0_sys_clk_en : R/W; bitpos: [18]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart0_sys_clk_en:1;
        /** reg_uart1_sys_clk_en : R/W; bitpos: [19]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart1_sys_clk_en:1;
        /** reg_uart2_sys_clk_en : R/W; bitpos: [20]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart2_sys_clk_en:1;
        /** reg_uart3_sys_clk_en : R/W; bitpos: [21]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart3_sys_clk_en:1;
        /** reg_uart4_sys_clk_en : R/W; bitpos: [22]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart4_sys_clk_en:1;
        /** reg_parlio_sys_clk_en : R/W; bitpos: [23]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_sys_clk_en:1;
        /** reg_etm_sys_clk_en : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_etm_sys_clk_en:1;
        /** reg_pvt_sys_clk_en : R/W; bitpos: [25]; default: 0;
         *  Reserved
         */
        uint32_t reg_pvt_sys_clk_en:1;
        /** reg_crypto_sys_clk_en : R/W; bitpos: [26]; default: 1;
         *  Reserved
         */
        uint32_t reg_crypto_sys_clk_en:1;
        /** reg_key_manager_sys_clk_en : R/W; bitpos: [27]; default: 1;
         *  Reserved
         */
        uint32_t reg_key_manager_sys_clk_en:1;
        /** reg_bitsrambler_sys_clk_en : R/W; bitpos: [28]; default: 1;
         *  Reserved
         */
        uint32_t reg_bitsrambler_sys_clk_en:1;
        /** reg_bitsrambler_rx_sys_clk_en : R/W; bitpos: [29]; default: 1;
         *  Reserved
         */
        uint32_t reg_bitsrambler_rx_sys_clk_en:1;
        /** reg_bitsrambler_tx_sys_clk_en : R/W; bitpos: [30]; default: 1;
         *  Reserved
         */
        uint32_t reg_bitsrambler_tx_sys_clk_en:1;
        /** reg_h264_sys_clk_en : R/W; bitpos: [31]; default: 0;
         *  Reserved
         */
        uint32_t reg_h264_sys_clk_en:1;
    };
    uint32_t val;
} hp_sys_clkrst_soc_clk_ctrl1_reg_t;

/** Type of soc_clk_ctrl2 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_rmt_sys_clk_en : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_rmt_sys_clk_en:1;
        /** reg_hp_clkrst_apb_clk_en : R/W; bitpos: [1]; default: 1;
         *  Reserved
         */
        uint32_t reg_hp_clkrst_apb_clk_en:1;
        /** reg_sysreg_apb_clk_en : R/W; bitpos: [2]; default: 1;
         *  Reserved
         */
        uint32_t reg_sysreg_apb_clk_en:1;
        /** reg_icm_apb_clk_en : R/W; bitpos: [3]; default: 1;
         *  Reserved
         */
        uint32_t reg_icm_apb_clk_en:1;
        /** reg_intrmtx_apb_clk_en : R/W; bitpos: [4]; default: 1;
         *  Reserved
         */
        uint32_t reg_intrmtx_apb_clk_en:1;
        /** reg_adc_apb_clk_en : R/W; bitpos: [5]; default: 0;
         *  Reserved
         */
        uint32_t reg_adc_apb_clk_en:1;
        /** reg_uhci_apb_clk_en : R/W; bitpos: [6]; default: 1;
         *  Reserved
         */
        uint32_t reg_uhci_apb_clk_en:1;
        /** reg_uart0_apb_clk_en : R/W; bitpos: [7]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart0_apb_clk_en:1;
        /** reg_uart1_apb_clk_en : R/W; bitpos: [8]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart1_apb_clk_en:1;
        /** reg_uart2_apb_clk_en : R/W; bitpos: [9]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart2_apb_clk_en:1;
        /** reg_uart3_apb_clk_en : R/W; bitpos: [10]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart3_apb_clk_en:1;
        /** reg_uart4_apb_clk_en : R/W; bitpos: [11]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart4_apb_clk_en:1;
        /** reg_i2c0_apb_clk_en : R/W; bitpos: [12]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c0_apb_clk_en:1;
        /** reg_i2c1_apb_clk_en : R/W; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c1_apb_clk_en:1;
        /** reg_i2s0_apb_clk_en : R/W; bitpos: [14]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_apb_clk_en:1;
        /** reg_i2s1_apb_clk_en : R/W; bitpos: [15]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_apb_clk_en:1;
        /** reg_i2s2_apb_clk_en : R/W; bitpos: [16]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_apb_clk_en:1;
        /** reg_i3c_mst_apb_clk_en : R/W; bitpos: [17]; default: 0;
         *  Reserved
         */
        uint32_t reg_i3c_mst_apb_clk_en:1;
        /** reg_i3c_slv_apb_clk_en : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_i3c_slv_apb_clk_en:1;
        /** reg_gpspi2_apb_clk_en : R/W; bitpos: [19]; default: 1;
         *  Reserved
         */
        uint32_t reg_gpspi2_apb_clk_en:1;
        /** reg_gpspi3_apb_clk_en : R/W; bitpos: [20]; default: 1;
         *  Reserved
         */
        uint32_t reg_gpspi3_apb_clk_en:1;
        /** reg_timergrp0_apb_clk_en : R/W; bitpos: [21]; default: 1;
         *  Reserved
         */
        uint32_t reg_timergrp0_apb_clk_en:1;
        /** reg_timergrp1_apb_clk_en : R/W; bitpos: [22]; default: 1;
         *  Reserved
         */
        uint32_t reg_timergrp1_apb_clk_en:1;
        /** reg_systimer_apb_clk_en : R/W; bitpos: [23]; default: 1;
         *  Reserved
         */
        uint32_t reg_systimer_apb_clk_en:1;
        /** reg_twai0_apb_clk_en : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_twai0_apb_clk_en:1;
        /** reg_twai1_apb_clk_en : R/W; bitpos: [25]; default: 0;
         *  Reserved
         */
        uint32_t reg_twai1_apb_clk_en:1;
        /** reg_twai2_apb_clk_en : R/W; bitpos: [26]; default: 0;
         *  Reserved
         */
        uint32_t reg_twai2_apb_clk_en:1;
        /** reg_mcpwm0_apb_clk_en : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_mcpwm0_apb_clk_en:1;
        /** reg_mcpwm1_apb_clk_en : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_mcpwm1_apb_clk_en:1;
        /** reg_usb_device_apb_clk_en : R/W; bitpos: [29]; default: 1;
         *  Reserved
         */
        uint32_t reg_usb_device_apb_clk_en:1;
        /** reg_pcnt_apb_clk_en : R/W; bitpos: [30]; default: 0;
         *  Reserved
         */
        uint32_t reg_pcnt_apb_clk_en:1;
        /** reg_parlio_apb_clk_en : R/W; bitpos: [31]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_apb_clk_en:1;
    };
    uint32_t val;
} hp_sys_clkrst_soc_clk_ctrl2_reg_t;

