espressif/esp-idf/components/soc/esp32p4/include/soc/hp_sys_clkrst_struct.h
/** Type of soc_clk_ctrl3 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_ledc_apb_clk_en : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_ledc_apb_clk_en:1;
        /** reg_lcdcam_apb_clk_en : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_lcdcam_apb_clk_en:1;
        /** reg_etm_apb_clk_en : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_etm_apb_clk_en:1;
        /** reg_iomux_apb_clk_en : R/W; bitpos: [3]; default: 1;
         *  Reserved
         */
        uint32_t reg_iomux_apb_clk_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_sys_clkrst_soc_clk_ctrl3_reg_t;


/** Group: ref_clk_ctrl */
/** Type of ref_clk_ctrl0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_ref_50m_clk_div_num : R/W; bitpos: [7:0]; default: 9;
         *  Reserved
         */
        uint32_t reg_ref_50m_clk_div_num:8;
        /** reg_ref_25m_clk_div_num : R/W; bitpos: [15:8]; default: 19;
         *  Reserved
         */
        uint32_t reg_ref_25m_clk_div_num:8;
        /** reg_ref_240m_clk_div_num : R/W; bitpos: [23:16]; default: 1;
         *  Reserved
         */
        uint32_t reg_ref_240m_clk_div_num:8;
        /** reg_ref_160m_clk_div_num : R/W; bitpos: [31:24]; default: 2;
         *  Reserved
         */
        uint32_t reg_ref_160m_clk_div_num:8;
    };
    uint32_t val;
} hp_sys_clkrst_ref_clk_ctrl0_reg_t;

/** Type of ref_clk_ctrl1 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_ref_120m_clk_div_num : R/W; bitpos: [7:0]; default: 3;
         *  Reserved
         */
        uint32_t reg_ref_120m_clk_div_num:8;
        /** reg_ref_80m_clk_div_num : R/W; bitpos: [15:8]; default: 5;
         *  Reserved
         */
        uint32_t reg_ref_80m_clk_div_num:8;
        /** reg_ref_20m_clk_div_num : R/W; bitpos: [23:16]; default: 23;
         *  Reserved
         */
        uint32_t reg_ref_20m_clk_div_num:8;
        /** reg_tm_400m_clk_en : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_400m_clk_en:1;
        /** reg_tm_200m_clk_en : R/W; bitpos: [25]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_200m_clk_en:1;
        /** reg_tm_100m_clk_en : R/W; bitpos: [26]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_100m_clk_en:1;
        /** reg_ref_50m_clk_en : R/W; bitpos: [27]; default: 1;
         *  Reserved
         */
        uint32_t reg_ref_50m_clk_en:1;
        /** reg_ref_25m_clk_en : R/W; bitpos: [28]; default: 1;
         *  Reserved
         */
        uint32_t reg_ref_25m_clk_en:1;
        /** reg_tm_480m_clk_en : R/W; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_480m_clk_en:1;
        /** reg_ref_240m_clk_en : R/W; bitpos: [30]; default: 1;
         *  Reserved
         */
        uint32_t reg_ref_240m_clk_en:1;
        /** reg_tm_240m_clk_en : R/W; bitpos: [31]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_240m_clk_en:1;
    };
    uint32_t val;
} hp_sys_clkrst_ref_clk_ctrl1_reg_t;

/** Type of ref_clk_ctrl2 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_ref_160m_clk_en : R/W; bitpos: [0]; default: 1;
         *  Reserved
         */
        uint32_t reg_ref_160m_clk_en:1;
        /** reg_tm_160m_clk_en : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_160m_clk_en:1;
        /** reg_ref_120m_clk_en : R/W; bitpos: [2]; default: 1;
         *  Reserved
         */
        uint32_t reg_ref_120m_clk_en:1;
        /** reg_tm_120m_clk_en : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_120m_clk_en:1;
        /** reg_ref_80m_clk_en : R/W; bitpos: [4]; default: 1;
         *  Reserved
         */
        uint32_t reg_ref_80m_clk_en:1;
        /** reg_tm_80m_clk_en : R/W; bitpos: [5]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_80m_clk_en:1;
        /** reg_tm_60m_clk_en : R/W; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_60m_clk_en:1;
        /** reg_tm_48m_clk_en : R/W; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_48m_clk_en:1;
        /** reg_ref_20m_clk_en : R/W; bitpos: [8]; default: 1;
         *  Reserved
         */
        uint32_t reg_ref_20m_clk_en:1;
        /** reg_tm_20m_clk_en : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_tm_20m_clk_en:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} hp_sys_clkrst_ref_clk_ctrl2_reg_t;


/** Group: peri_clk_ctrl0 */
/** Type of peri_clk_ctrl00 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_flash_clk_src_sel : R/W; bitpos: [1:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_flash_clk_src_sel:2;
        /** reg_flash_pll_clk_en : R/W; bitpos: [2]; default: 1;
         *  Reserved
         */
        uint32_t reg_flash_pll_clk_en:1;
        /** reg_flash_core_clk_en : R/W; bitpos: [3]; default: 1;
         *  Reserved
         */
        uint32_t reg_flash_core_clk_en:1;
        /** reg_flash_core_clk_div_num : R/W; bitpos: [11:4]; default: 3;
         *  Reserved
         */
        uint32_t reg_flash_core_clk_div_num:8;
        /** reg_psram_clk_src_sel : R/W; bitpos: [13:12]; default: 0;
         *  Reserved
         */
        uint32_t reg_psram_clk_src_sel:2;
        /** reg_psram_pll_clk_en : R/W; bitpos: [14]; default: 1;
         *  Reserved
         */
        uint32_t reg_psram_pll_clk_en:1;
        /** reg_psram_core_clk_en : R/W; bitpos: [15]; default: 1;
         *  Reserved
         */
        uint32_t reg_psram_core_clk_en:1;
        /** reg_psram_core_clk_div_num : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_psram_core_clk_div_num:8;
        /** reg_pad_emac_ref_clk_en : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_pad_emac_ref_clk_en:1;
        /** reg_emac_rmii_clk_src_sel : R/W; bitpos: [26:25]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_rmii_clk_src_sel:2;
        /** reg_emac_rmii_clk_en : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_rmii_clk_en:1;
        /** reg_emac_rx_clk_src_sel : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_rx_clk_src_sel:1;
        /** reg_emac_rx_clk_en : R/W; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_rx_clk_en:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl00_reg_t;

