espressif/esp-idf/components/soc/esp32p4/include/soc/hp_sys_clkrst_struct.h
/** Type of peri_clk_ctrl01 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_emac_rx_clk_div_num : R/W; bitpos: [7:0]; default: 1;
         *  Reserved
         */
        uint32_t reg_emac_rx_clk_div_num:8;
        /** reg_emac_tx_clk_src_sel : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_tx_clk_src_sel:1;
        /** reg_emac_tx_clk_en : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_tx_clk_en:1;
        /** reg_emac_tx_clk_div_num : R/W; bitpos: [17:10]; default: 1;
         *  Reserved
         */
        uint32_t reg_emac_tx_clk_div_num:8;
        /** reg_emac_ptp_ref_clk_src_sel : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_ptp_ref_clk_src_sel:1;
        /** reg_emac_ptp_ref_clk_en : R/W; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_ptp_ref_clk_en:1;
        /** reg_emac_unused0_clk_en : R/W; bitpos: [20]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_unused0_clk_en:1;
        /** reg_emac_unused1_clk_en : R/W; bitpos: [21]; default: 0;
         *  Reserved
         */
        uint32_t reg_emac_unused1_clk_en:1;
        /** reg_sdio_hs_mode : R/W; bitpos: [22]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_hs_mode:1;
        /** reg_sdio_ls_clk_src_sel : R/W; bitpos: [23]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_clk_src_sel:1;
        /** reg_sdio_ls_clk_en : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_clk_en:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl01_reg_t;

/** Type of peri_clk_ctrl02 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_sdio_ls_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_clk_div_num:8;
        /** reg_sdio_ls_clk_edge_cfg_update : WT; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_clk_edge_cfg_update:1;
        /** reg_sdio_ls_clk_edge_l : R/W; bitpos: [12:9]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_clk_edge_l:4;
        /** reg_sdio_ls_clk_edge_h : R/W; bitpos: [16:13]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_clk_edge_h:4;
        /** reg_sdio_ls_clk_edge_n : R/W; bitpos: [20:17]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_clk_edge_n:4;
        /** reg_sdio_ls_slf_clk_edge_sel : R/W; bitpos: [22:21]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_slf_clk_edge_sel:2;
        /** reg_sdio_ls_drv_clk_edge_sel : R/W; bitpos: [24:23]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_drv_clk_edge_sel:2;
        /** reg_sdio_ls_sam_clk_edge_sel : R/W; bitpos: [26:25]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_sam_clk_edge_sel:2;
        /** reg_sdio_ls_slf_clk_en : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_slf_clk_en:1;
        /** reg_sdio_ls_drv_clk_en : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_drv_clk_en:1;
        /** reg_sdio_ls_sam_clk_en : R/W; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_ls_sam_clk_en:1;
        /** reg_mipi_dsi_dphy_clk_src_sel : R/W; bitpos: [31:30]; default: 0;
         *  Reserved
         */
        uint32_t reg_mipi_dsi_dphy_clk_src_sel:2;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl02_reg_t;

/** Type of peri_clk_ctrl03 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_mipi_dsi_dphy_cfg_clk_en : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_mipi_dsi_dphy_cfg_clk_en:1;
        /** reg_mipi_dsi_dphy_pll_refclk_en : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_mipi_dsi_dphy_pll_refclk_en:1;
        /** reg_mipi_csi_dphy_clk_src_sel : R/W; bitpos: [3:2]; default: 0;
         *  Reserved
         */
        uint32_t reg_mipi_csi_dphy_clk_src_sel:2;
        /** reg_mipi_csi_dphy_cfg_clk_en : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_mipi_csi_dphy_cfg_clk_en:1;
        /** reg_mipi_dsi_dpiclk_src_sel : R/W; bitpos: [6:5]; default: 0;
         *  Reserved
         */
        uint32_t reg_mipi_dsi_dpiclk_src_sel:2;
        /** reg_mipi_dsi_dpiclk_en : R/W; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t reg_mipi_dsi_dpiclk_en:1;
        /** reg_mipi_dsi_dpiclk_div_num : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_mipi_dsi_dpiclk_div_num:8;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl03_reg_t;


/** Group: peri_clk_ctrl1 */
/** Type of peri_clk_ctrl10 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_i2c0_clk_src_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c0_clk_src_sel:1;
        /** reg_i2c0_clk_en : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c0_clk_en:1;
        /** reg_i2c0_clk_div_num : R/W; bitpos: [9:2]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c0_clk_div_num:8;
        /** reg_i2c0_clk_div_numerator : R/W; bitpos: [17:10]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c0_clk_div_numerator:8;
        /** reg_i2c0_clk_div_denominator : R/W; bitpos: [25:18]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c0_clk_div_denominator:8;
        /** reg_i2c1_clk_src_sel : R/W; bitpos: [26]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c1_clk_src_sel:1;
        /** reg_i2c1_clk_en : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c1_clk_en:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl10_reg_t;

