espressif/esp-idf/components/soc/esp32p4/include/soc/hp_sys_clkrst_struct.h
/** Type of peri_clk_ctrl11 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_i2c1_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c1_clk_div_num:8;
        /** reg_i2c1_clk_div_numerator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c1_clk_div_numerator:8;
        /** reg_i2c1_clk_div_denominator : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2c1_clk_div_denominator:8;
        /** reg_i2s0_rx_clk_en : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_rx_clk_en:1;
        /** reg_i2s0_rx_clk_src_sel : R/W; bitpos: [26:25]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_rx_clk_src_sel:2;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl11_reg_t;

/** Type of peri_clk_ctrl12 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_i2s0_rx_div_n : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_rx_div_n:8;
        /** reg_i2s0_rx_div_x : R/W; bitpos: [16:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_rx_div_x:9;
        /** reg_i2s0_rx_div_y : R/W; bitpos: [25:17]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_rx_div_y:9;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl12_reg_t;

/** Type of peri_clk_ctrl13 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_i2s0_rx_div_z : R/W; bitpos: [8:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_rx_div_z:9;
        /** reg_i2s0_rx_div_yn1 : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_rx_div_yn1:1;
        /** reg_i2s0_tx_clk_en : R/W; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_tx_clk_en:1;
        /** reg_i2s0_tx_clk_src_sel : R/W; bitpos: [12:11]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_tx_clk_src_sel:2;
        /** reg_i2s0_tx_div_n : R/W; bitpos: [20:13]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_tx_div_n:8;
        /** reg_i2s0_tx_div_x : R/W; bitpos: [29:21]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_tx_div_x:9;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl13_reg_t;

/** Type of peri_clk_ctrl14 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_i2s0_tx_div_y : R/W; bitpos: [8:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_tx_div_y:9;
        /** reg_i2s0_tx_div_z : R/W; bitpos: [17:9]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_tx_div_z:9;
        /** reg_i2s0_tx_div_yn1 : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_tx_div_yn1:1;
        /** reg_i2s0_mst_clk_sel : R/W; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s0_mst_clk_sel:1;
        /** reg_i2s1_rx_clk_en : R/W; bitpos: [20]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_rx_clk_en:1;
        /** reg_i2s1_rx_clk_src_sel : R/W; bitpos: [22:21]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_rx_clk_src_sel:2;
        /** reg_i2s1_rx_div_n : R/W; bitpos: [30:23]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_rx_div_n:8;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl14_reg_t;

/** Type of peri_clk_ctrl15 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_i2s1_rx_div_x : R/W; bitpos: [8:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_rx_div_x:9;
        /** reg_i2s1_rx_div_y : R/W; bitpos: [17:9]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_rx_div_y:9;
        /** reg_i2s1_rx_div_z : R/W; bitpos: [26:18]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_rx_div_z:9;
        /** reg_i2s1_rx_div_yn1 : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_rx_div_yn1:1;
        /** reg_i2s1_tx_clk_en : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_tx_clk_en:1;
        /** reg_i2s1_tx_clk_src_sel : R/W; bitpos: [30:29]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_tx_clk_src_sel:2;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl15_reg_t;

/** Type of peri_clk_ctrl16 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_i2s1_tx_div_n : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_tx_div_n:8;
        /** reg_i2s1_tx_div_x : R/W; bitpos: [16:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_tx_div_x:9;
        /** reg_i2s1_tx_div_y : R/W; bitpos: [25:17]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_tx_div_y:9;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl16_reg_t;

/** Type of peri_clk_ctrl17 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_i2s1_tx_div_z : R/W; bitpos: [8:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_tx_div_z:9;
        /** reg_i2s1_tx_div_yn1 : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_tx_div_yn1:1;
        /** reg_i2s1_mst_clk_sel : R/W; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s1_mst_clk_sel:1;
        /** reg_i2s2_rx_clk_en : R/W; bitpos: [11]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_rx_clk_en:1;
        /** reg_i2s2_rx_clk_src_sel : R/W; bitpos: [13:12]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_rx_clk_src_sel:2;
        /** reg_i2s2_rx_div_n : R/W; bitpos: [21:14]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_rx_div_n:8;
        /** reg_i2s2_rx_div_x : R/W; bitpos: [30:22]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_rx_div_x:9;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl17_reg_t;

/** Type of peri_clk_ctrl18 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_i2s2_rx_div_y : R/W; bitpos: [8:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_rx_div_y:9;
        /** reg_i2s2_rx_div_z : R/W; bitpos: [17:9]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_rx_div_z:9;
        /** reg_i2s2_rx_div_yn1 : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_rx_div_yn1:1;
        /** reg_i2s2_tx_clk_en : R/W; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_tx_clk_en:1;
        /** reg_i2s2_tx_clk_src_sel : R/W; bitpos: [21:20]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_tx_clk_src_sel:2;
        /** reg_i2s2_tx_div_n : R/W; bitpos: [29:22]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_tx_div_n:8;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl18_reg_t;

