espressif/esp-idf/components/soc/esp32p4/include/soc/hp_sys_clkrst_struct.h
/** Type of peri_clk_ctrl19 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_i2s2_tx_div_x : R/W; bitpos: [8:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_tx_div_x:9;
        /** reg_i2s2_tx_div_y : R/W; bitpos: [17:9]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_tx_div_y:9;
        /** reg_i2s2_tx_div_z : R/W; bitpos: [26:18]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_tx_div_z:9;
        /** reg_i2s2_tx_div_yn1 : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_tx_div_yn1:1;
        /** reg_i2s2_mst_clk_sel : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_i2s2_mst_clk_sel:1;
        /** reg_lcd_clk_src_sel : R/W; bitpos: [30:29]; default: 0;
         *  Reserved
         */
        uint32_t reg_lcd_clk_src_sel:2;
        /** reg_lcd_clk_en : R/W; bitpos: [31]; default: 0;
         *  Reserved
         */
        uint32_t reg_lcd_clk_en:1;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl19_reg_t;

/** Type of peri_clk_ctrl110 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_lcd_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_lcd_clk_div_num:8;
        /** reg_lcd_clk_div_numerator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_lcd_clk_div_numerator:8;
        /** reg_lcd_clk_div_denominator : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_lcd_clk_div_denominator:8;
        /** reg_uart0_clk_src_sel : R/W; bitpos: [25:24]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart0_clk_src_sel:2;
        /** reg_uart0_clk_en : R/W; bitpos: [26]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart0_clk_en:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl110_reg_t;

/** Type of peri_clk_ctrl111 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_uart0_sclk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart0_sclk_div_num:8;
        /** reg_uart0_sclk_div_numerator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart0_sclk_div_numerator:8;
        /** reg_uart0_sclk_div_denominator : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart0_sclk_div_denominator:8;
        /** reg_uart1_clk_src_sel : R/W; bitpos: [25:24]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart1_clk_src_sel:2;
        /** reg_uart1_clk_en : R/W; bitpos: [26]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart1_clk_en:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl111_reg_t;

/** Type of peri_clk_ctrl112 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_uart1_sclk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart1_sclk_div_num:8;
        /** reg_uart1_sclk_div_numerator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart1_sclk_div_numerator:8;
        /** reg_uart1_sclk_div_denominator : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart1_sclk_div_denominator:8;
        /** reg_uart2_clk_src_sel : R/W; bitpos: [25:24]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart2_clk_src_sel:2;
        /** reg_uart2_clk_en : R/W; bitpos: [26]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart2_clk_en:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl112_reg_t;

/** Type of peri_clk_ctrl113 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_uart2_sclk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart2_sclk_div_num:8;
        /** reg_uart2_sclk_div_numerator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart2_sclk_div_numerator:8;
        /** reg_uart2_sclk_div_denominator : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart2_sclk_div_denominator:8;
        /** reg_uart3_clk_src_sel : R/W; bitpos: [25:24]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart3_clk_src_sel:2;
        /** reg_uart3_clk_en : R/W; bitpos: [26]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart3_clk_en:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl113_reg_t;

/** Type of peri_clk_ctrl114 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_uart3_sclk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart3_sclk_div_num:8;
        /** reg_uart3_sclk_div_numerator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart3_sclk_div_numerator:8;
        /** reg_uart3_sclk_div_denominator : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart3_sclk_div_denominator:8;
        /** reg_uart4_clk_src_sel : R/W; bitpos: [25:24]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart4_clk_src_sel:2;
        /** reg_uart4_clk_en : R/W; bitpos: [26]; default: 1;
         *  Reserved
         */
        uint32_t reg_uart4_clk_en:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl114_reg_t;

/** Type of peri_clk_ctrl115 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_uart4_sclk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart4_sclk_div_num:8;
        /** reg_uart4_sclk_div_numerator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart4_sclk_div_numerator:8;
        /** reg_uart4_sclk_div_denominator : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_uart4_sclk_div_denominator:8;
        /** reg_twai0_clk_src_sel : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_twai0_clk_src_sel:1;
        /** reg_twai0_clk_en : R/W; bitpos: [25]; default: 0;
         *  Reserved
         */
        uint32_t reg_twai0_clk_en:1;
        /** reg_twai1_clk_src_sel : R/W; bitpos: [26]; default: 0;
         *  Reserved
         */
        uint32_t reg_twai1_clk_src_sel:1;
        /** reg_twai1_clk_en : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_twai1_clk_en:1;
        /** reg_twai2_clk_src_sel : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_twai2_clk_src_sel:1;
        /** reg_twai2_clk_en : R/W; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t reg_twai2_clk_en:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl115_reg_t;

