espressif/esp-idf/components/soc/esp32p4/include/soc/hp_sys_clkrst_struct.h
/** Type of peri_clk_ctrl116 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpspi2_clk_src_sel : R/W; bitpos: [2:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpspi2_clk_src_sel:3;
        /** reg_gpspi2_hs_clk_en : R/W; bitpos: [3]; default: 1;
         *  Reserved
         */
        uint32_t reg_gpspi2_hs_clk_en:1;
        /** reg_gpspi2_hs_clk_div_num : R/W; bitpos: [11:4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpspi2_hs_clk_div_num:8;
        /** reg_gpspi2_mst_clk_div_num : R/W; bitpos: [19:12]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpspi2_mst_clk_div_num:8;
        /** reg_gpspi2_mst_clk_en : R/W; bitpos: [20]; default: 1;
         *  Reserved
         */
        uint32_t reg_gpspi2_mst_clk_en:1;
        /** reg_gpspi3_clk_src_sel : R/W; bitpos: [23:21]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpspi3_clk_src_sel:3;
        /** reg_gpspi3_hs_clk_en : R/W; bitpos: [24]; default: 1;
         *  Reserved
         */
        uint32_t reg_gpspi3_hs_clk_en:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl116_reg_t;

/** Type of peri_clk_ctrl117 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpspi3_hs_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpspi3_hs_clk_div_num:8;
        /** reg_gpspi3_mst_clk_div_num : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpspi3_mst_clk_div_num:8;
        /** reg_gpspi3_mst_clk_en : R/W; bitpos: [16]; default: 1;
         *  Reserved
         */
        uint32_t reg_gpspi3_mst_clk_en:1;
        /** reg_parlio_rx_clk_src_sel : R/W; bitpos: [18:17]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_rx_clk_src_sel:2;
        /** reg_parlio_rx_clk_en : R/W; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_rx_clk_en:1;
        /** reg_parlio_rx_clk_div_num : R/W; bitpos: [27:20]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_rx_clk_div_num:8;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl117_reg_t;

/** Type of peri_clk_ctrl118 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_parlio_rx_clk_div_numerator : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_rx_clk_div_numerator:8;
        /** reg_parlio_rx_clk_div_denominator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_rx_clk_div_denominator:8;
        /** reg_parlio_tx_clk_src_sel : R/W; bitpos: [17:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_tx_clk_src_sel:2;
        /** reg_parlio_tx_clk_en : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_tx_clk_en:1;
        /** reg_parlio_tx_clk_div_num : R/W; bitpos: [26:19]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_tx_clk_div_num:8;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl118_reg_t;

/** Type of peri_clk_ctrl119 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_parlio_tx_clk_div_numerator : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_tx_clk_div_numerator:8;
        /** reg_parlio_tx_clk_div_denominator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_parlio_tx_clk_div_denominator:8;
        /** reg_i3c_mst_clk_src_sel : R/W; bitpos: [17:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_i3c_mst_clk_src_sel:2;
        /** reg_i3c_mst_clk_en : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_i3c_mst_clk_en:1;
        /** reg_i3c_mst_clk_div_num : R/W; bitpos: [26:19]; default: 0;
         *  Reserved
         */
        uint32_t reg_i3c_mst_clk_div_num:8;
        /** reg_cam_clk_src_sel : R/W; bitpos: [28:27]; default: 0;
         *  Reserved
         */
        uint32_t reg_cam_clk_src_sel:2;
        /** reg_cam_clk_en : R/W; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t reg_cam_clk_en:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl119_reg_t;

/** Type of peri_clk_ctrl120 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_cam_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_cam_clk_div_num:8;
        /** reg_cam_clk_div_numerator : R/W; bitpos: [15:8]; default: 0;
         *  Reserved
         */
        uint32_t reg_cam_clk_div_numerator:8;
        /** reg_cam_clk_div_denominator : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_cam_clk_div_denominator:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl120_reg_t;


/** Group: peri_clk_ctrl2 */
/** Type of peri_clk_ctrl20 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_mcpwm0_clk_src_sel : R/W; bitpos: [1:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_mcpwm0_clk_src_sel:2;
        /** reg_mcpwm0_clk_en : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_mcpwm0_clk_en:1;
        /** reg_mcpwm0_clk_div_num : R/W; bitpos: [10:3]; default: 0;
         *  Reserved
         */
        uint32_t reg_mcpwm0_clk_div_num:8;
        /** reg_mcpwm1_clk_src_sel : R/W; bitpos: [12:11]; default: 0;
         *  Reserved
         */
        uint32_t reg_mcpwm1_clk_src_sel:2;
        /** reg_mcpwm1_clk_en : R/W; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t reg_mcpwm1_clk_en:1;
        /** reg_mcpwm1_clk_div_num : R/W; bitpos: [21:14]; default: 0;
         *  Reserved
         */
        uint32_t reg_mcpwm1_clk_div_num:8;
        /** reg_timergrp0_t0_src_sel : R/W; bitpos: [23:22]; default: 0;
         *  Reserved
         */
        uint32_t reg_timergrp0_t0_src_sel:2;
        /** reg_timergrp0_t0_clk_en : R/W; bitpos: [24]; default: 1;
         *  Reserved
         */
        uint32_t reg_timergrp0_t0_clk_en:1;
        /** reg_timergrp0_t1_src_sel : R/W; bitpos: [26:25]; default: 0;
         *  Reserved
         */
        uint32_t reg_timergrp0_t1_src_sel:2;
        /** reg_timergrp0_t1_clk_en : R/W; bitpos: [27]; default: 1;
         *  Reserved
         */
        uint32_t reg_timergrp0_t1_clk_en:1;
        /** reg_timergrp0_wdt_src_sel : R/W; bitpos: [29:28]; default: 0;
         *  Reserved
         */
        uint32_t reg_timergrp0_wdt_src_sel:2;
        /** reg_timergrp0_wdt_clk_en : R/W; bitpos: [30]; default: 1;
         *  Reserved
         */
        uint32_t reg_timergrp0_wdt_clk_en:1;
        /** reg_timergrp0_tgrt_clk_en : R/W; bitpos: [31]; default: 1;
         *  Reserved
         */
        uint32_t reg_timergrp0_tgrt_clk_en:1;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl20_reg_t;

/** Type of peri_clk_ctrl21 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_timergrp0_tgrt_clk_src_sel : R/W; bitpos: [3:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_timergrp0_tgrt_clk_src_sel:4;
        /** reg_timergrp0_tgrt_clk_div_num : R/W; bitpos: [19:4]; default: 0;
         *  Reserved
         */
        uint32_t reg_timergrp0_tgrt_clk_div_num:16;
        /** reg_timergrp1_t0_src_sel : R/W; bitpos: [21:20]; default: 0;
         *  Reserved
         */
        uint32_t reg_timergrp1_t0_src_sel:2;
        /** reg_timergrp1_t0_clk_en : R/W; bitpos: [22]; default: 1;
         *  Reserved
         */
        uint32_t reg_timergrp1_t0_clk_en:1;
        /** reg_timergrp1_t1_src_sel : R/W; bitpos: [24:23]; default: 0;
         *  Reserved
         */
        uint32_t reg_timergrp1_t1_src_sel:2;
        /** reg_timergrp1_t1_clk_en : R/W; bitpos: [25]; default: 1;
         *  Reserved
         */
        uint32_t reg_timergrp1_t1_clk_en:1;
        /** reg_timergrp1_wdt_src_sel : R/W; bitpos: [27:26]; default: 0;
         *  Reserved
         */
        uint32_t reg_timergrp1_wdt_src_sel:2;
        /** reg_timergrp1_wdt_clk_en : R/W; bitpos: [28]; default: 1;
         *  Reserved
         */
        uint32_t reg_timergrp1_wdt_clk_en:1;
        /** reg_systimer_clk_src_sel : R/W; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t reg_systimer_clk_src_sel:1;
        /** reg_systimer_clk_en : R/W; bitpos: [30]; default: 1;
         *  Reserved
         */
        uint32_t reg_systimer_clk_en:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl21_reg_t;

/** Type of peri_clk_ctrl22 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_ledc_clk_src_sel : R/W; bitpos: [1:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_ledc_clk_src_sel:2;
        /** reg_ledc_clk_en : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_ledc_clk_en:1;
        /** reg_rmt_clk_src_sel : R/W; bitpos: [4:3]; default: 0;
         *  Reserved
         */
        uint32_t reg_rmt_clk_src_sel:2;
        /** reg_rmt_clk_en : R/W; bitpos: [5]; default: 0;
         *  Reserved
         */
        uint32_t reg_rmt_clk_en:1;
        /** reg_rmt_clk_div_num : R/W; bitpos: [13:6]; default: 0;
         *  Reserved
         */
        uint32_t reg_rmt_clk_div_num:8;
        /** reg_rmt_clk_div_numerator : R/W; bitpos: [21:14]; default: 0;
         *  Reserved
         */
        uint32_t reg_rmt_clk_div_numerator:8;
        /** reg_rmt_clk_div_denominator : R/W; bitpos: [29:22]; default: 0;
         *  Reserved
         */
        uint32_t reg_rmt_clk_div_denominator:8;
        /** reg_adc_clk_src_sel : R/W; bitpos: [31:30]; default: 0;
         *  Reserved
         */
        uint32_t reg_adc_clk_src_sel:2;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl22_reg_t;

