espressif/esp-idf/components/soc/esp32p4/include/soc/hp_sys_clkrst_struct.h
/** Type of peri_clk_ctrl23 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_adc_clk_en : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_adc_clk_en:1;
        /** reg_adc_clk_div_num : R/W; bitpos: [8:1]; default: 4;
         *  Reserved
         */
        uint32_t reg_adc_clk_div_num:8;
        /** reg_adc_clk_div_numerator : R/W; bitpos: [16:9]; default: 0;
         *  Reserved
         */
        uint32_t reg_adc_clk_div_numerator:8;
        /** reg_adc_clk_div_denominator : R/W; bitpos: [24:17]; default: 0;
         *  Reserved
         */
        uint32_t reg_adc_clk_div_denominator:8;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl23_reg_t;

/** Type of peri_clk_ctrl24 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_adc_sar1_clk_div_num : R/W; bitpos: [7:0]; default: 4;
         *  Reserved
         */
        uint32_t reg_adc_sar1_clk_div_num:8;
        /** reg_adc_sar2_clk_div_num : R/W; bitpos: [15:8]; default: 4;
         *  Reserved
         */
        uint32_t reg_adc_sar2_clk_div_num:8;
        /** reg_pvt_clk_div_num : R/W; bitpos: [23:16]; default: 0;
         *  Reserved
         */
        uint32_t reg_pvt_clk_div_num:8;
        /** reg_pvt_clk_en : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_pvt_clk_en:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl24_reg_t;

/** Type of peri_clk_ctrl25 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_pvt_peri_group_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_pvt_peri_group_clk_div_num:8;
        /** reg_pvt_peri_group1_clk_en : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_pvt_peri_group1_clk_en:1;
        /** reg_pvt_peri_group2_clk_en : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_pvt_peri_group2_clk_en:1;
        /** reg_pvt_peri_group3_clk_en : R/W; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t reg_pvt_peri_group3_clk_en:1;
        /** reg_pvt_peri_group4_clk_en : R/W; bitpos: [11]; default: 0;
         *  Reserved
         */
        uint32_t reg_pvt_peri_group4_clk_en:1;
        /** reg_crypto_clk_src_sel : R/W; bitpos: [13:12]; default: 0;
         *  Reserved
         */
        uint32_t reg_crypto_clk_src_sel:2;
        /** reg_crypto_aes_clk_en : R/W; bitpos: [14]; default: 1;
         *  Reserved
         */
        uint32_t reg_crypto_aes_clk_en:1;
        /** reg_crypto_ds_clk_en : R/W; bitpos: [15]; default: 1;
         *  Reserved
         */
        uint32_t reg_crypto_ds_clk_en:1;
        /** reg_crypto_ecc_clk_en : R/W; bitpos: [16]; default: 1;
         *  Reserved
         */
        uint32_t reg_crypto_ecc_clk_en:1;
        /** reg_crypto_hmac_clk_en : R/W; bitpos: [17]; default: 1;
         *  Reserved
         */
        uint32_t reg_crypto_hmac_clk_en:1;
        /** reg_crypto_rsa_clk_en : R/W; bitpos: [18]; default: 1;
         *  Reserved
         */
        uint32_t reg_crypto_rsa_clk_en:1;
        /** reg_crypto_sec_clk_en : R/W; bitpos: [19]; default: 1;
         *  Reserved
         */
        uint32_t reg_crypto_sec_clk_en:1;
        /** reg_crypto_sha_clk_en : R/W; bitpos: [20]; default: 1;
         *  Reserved
         */
        uint32_t reg_crypto_sha_clk_en:1;
        /** reg_crypto_ecdsa_clk_en : R/W; bitpos: [21]; default: 1;
         *  Reserved
         */
        uint32_t reg_crypto_ecdsa_clk_en:1;
        /** reg_crypto_km_clk_en : R/W; bitpos: [22]; default: 1;
         *  Reserved
         */
        uint32_t reg_crypto_km_clk_en:1;
        /** reg_isp_clk_src_sel : R/W; bitpos: [24:23]; default: 0;
         *  Reserved
         */
        uint32_t reg_isp_clk_src_sel:2;
        /** reg_isp_clk_en : R/W; bitpos: [25]; default: 0;
         *  Reserved
         */
        uint32_t reg_isp_clk_en:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl25_reg_t;

/** Type of peri_clk_ctrl26 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_isp_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_isp_clk_div_num:8;
        /** reg_iomux_clk_src_sel : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_iomux_clk_src_sel:1;
        /** reg_iomux_clk_en : R/W; bitpos: [9]; default: 1;
         *  Reserved
         */
        uint32_t reg_iomux_clk_en:1;
        /** reg_iomux_clk_div_num : R/W; bitpos: [17:10]; default: 0;
         *  Reserved
         */
        uint32_t reg_iomux_clk_div_num:8;
        /** reg_h264_clk_src_sel : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_h264_clk_src_sel:1;
        /** reg_h264_clk_en : R/W; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t reg_h264_clk_en:1;
        /** reg_h264_clk_div_num : R/W; bitpos: [27:20]; default: 0;
         *  Reserved
         */
        uint32_t reg_h264_clk_div_num:8;
        /** reg_padbist_rx_clk_src_sel : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_padbist_rx_clk_src_sel:1;
        /** reg_padbist_rx_clk_en : R/W; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t reg_padbist_rx_clk_en:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl26_reg_t;

/** Type of peri_clk_ctrl27 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_padbist_rx_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_padbist_rx_clk_div_num:8;
        /** reg_padbist_tx_clk_src_sel : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_padbist_tx_clk_src_sel:1;
        /** reg_padbist_tx_clk_en : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_padbist_tx_clk_en:1;
        /** reg_padbist_tx_clk_div_num : R/W; bitpos: [17:10]; default: 0;
         *  Reserved
         */
        uint32_t reg_padbist_tx_clk_div_num:8;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} hp_sys_clkrst_peri_clk_ctrl27_reg_t;


