espressif/esp-idf/components/soc/esp32p4/include/soc/hp_sys_clkrst_struct.h
/** Group: clk_force_on_ctrl */
/** Type of clk_force_on_ctrl0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_cpuicm_gated_clk_force_on : R/W; bitpos: [0]; default: 1;
         *  Reserved
         */
        uint32_t reg_cpuicm_gated_clk_force_on:1;
        /** reg_tcm_cpu_clk_force_on : R/W; bitpos: [1]; default: 1;
         *  Reserved
         */
        uint32_t reg_tcm_cpu_clk_force_on:1;
        /** reg_busmon_cpu_clk_force_on : R/W; bitpos: [2]; default: 1;
         *  Reserved
         */
        uint32_t reg_busmon_cpu_clk_force_on:1;
        /** reg_l1cache_cpu_clk_force_on : R/W; bitpos: [3]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_cpu_clk_force_on:1;
        /** reg_l1cache_d_cpu_clk_force_on : R/W; bitpos: [4]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_d_cpu_clk_force_on:1;
        /** reg_l1cache_i0_cpu_clk_force_on : R/W; bitpos: [5]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_i0_cpu_clk_force_on:1;
        /** reg_l1cache_i1_cpu_clk_force_on : R/W; bitpos: [6]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_i1_cpu_clk_force_on:1;
        /** reg_trace_cpu_clk_force_on : R/W; bitpos: [7]; default: 1;
         *  Reserved
         */
        uint32_t reg_trace_cpu_clk_force_on:1;
        /** reg_trace_sys_clk_force_on : R/W; bitpos: [8]; default: 1;
         *  Reserved
         */
        uint32_t reg_trace_sys_clk_force_on:1;
        /** reg_l1cache_mem_clk_force_on : R/W; bitpos: [9]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_mem_clk_force_on:1;
        /** reg_l1cache_d_mem_clk_force_on : R/W; bitpos: [10]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_d_mem_clk_force_on:1;
        /** reg_l1cache_i0_mem_clk_force_on : R/W; bitpos: [11]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_i0_mem_clk_force_on:1;
        /** reg_l1cache_i1_mem_clk_force_on : R/W; bitpos: [12]; default: 1;
         *  Reserved
         */
        uint32_t reg_l1cache_i1_mem_clk_force_on:1;
        /** reg_l2cache_mem_clk_force_on : R/W; bitpos: [13]; default: 1;
         *  Reserved
         */
        uint32_t reg_l2cache_mem_clk_force_on:1;
        /** reg_l2mem_mem_clk_force_on : R/W; bitpos: [14]; default: 1;
         *  Reserved
         */
        uint32_t reg_l2mem_mem_clk_force_on:1;
        /** reg_sar1_clk_force_on : R/W; bitpos: [15]; default: 1;
         *  Reserved
         */
        uint32_t reg_sar1_clk_force_on:1;
        /** reg_sar2_clk_force_on : R/W; bitpos: [16]; default: 1;
         *  Reserved
         */
        uint32_t reg_sar2_clk_force_on:1;
        /** reg_gmac_tx_clk_force_on : R/W; bitpos: [17]; default: 1;
         *  Reserved
         */
        uint32_t reg_gmac_tx_clk_force_on:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} hp_sys_clkrst_clk_force_on_ctrl0_reg_t;


/** Group: dpa_ctrl */
/** Type of dpa_ctrl0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_sec_dpa_level : R/W; bitpos: [1:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_sec_dpa_level:2;
        /** reg_sec_dpa_cfg_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_sec_dpa_cfg_sel:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_sys_clkrst_dpa_ctrl0_reg_t;


/** Group: ana_pll_ctrl */
/** Type of ana_pll_ctrl0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_plla_cal_end : RO; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_plla_cal_end:1;
        /** reg_plla_cal_stop : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_plla_cal_stop:1;
        /** reg_cpu_pll_cal_end : RO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_cpu_pll_cal_end:1;
        /** reg_cpu_pll_cal_stop : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_cpu_pll_cal_stop:1;
        /** reg_sdio_pll_cal_end : RO; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_pll_cal_end:1;
        /** reg_sdio_pll_cal_stop : R/W; bitpos: [5]; default: 0;
         *  Reserved
         */
        uint32_t reg_sdio_pll_cal_stop:1;
        /** reg_sys_pll_cal_end : RO; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t reg_sys_pll_cal_end:1;
        /** reg_sys_pll_cal_stop : R/W; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t reg_sys_pll_cal_stop:1;
        /** reg_mspi_cal_end : RO; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_mspi_cal_end:1;
        /** reg_mspi_cal_stop : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_mspi_cal_stop:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} hp_sys_clkrst_ana_pll_ctrl0_reg_t;


/** Group: hp_rst_en */
/** Type of hp_rst_en0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_rst_en_corectrl : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_corectrl:1;
        /** reg_rst_en_pvt_top : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_pvt_top:1;
        /** reg_rst_en_pvt_peri_group1 : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_pvt_peri_group1:1;
        /** reg_rst_en_pvt_peri_group2 : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_pvt_peri_group2:1;
        /** reg_rst_en_pvt_peri_group3 : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_pvt_peri_group3:1;
        /** reg_rst_en_pvt_peri_group4 : R/W; bitpos: [5]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_pvt_peri_group4:1;
        /** reg_rst_en_regdma : R/W; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_regdma:1;
        /** reg_rst_en_core0_global : R/W; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_core0_global:1;
        /** reg_rst_en_core1_global : R/W; bitpos: [8]; default: 1;
         *  Reserved
         */
        uint32_t reg_rst_en_core1_global:1;
        /** reg_rst_en_coretrace0 : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_coretrace0:1;
        /** reg_rst_en_coretrace1 : R/W; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_coretrace1:1;
        /** reg_rst_en_hp_tcm : R/W; bitpos: [11]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_hp_tcm:1;
        /** reg_rst_en_hp_cache : R/W; bitpos: [12]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_hp_cache:1;
        /** reg_rst_en_l1_i0_cache : R/W; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_l1_i0_cache:1;
        /** reg_rst_en_l1_i1_cache : R/W; bitpos: [14]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_l1_i1_cache:1;
        /** reg_rst_en_l1_d_cache : R/W; bitpos: [15]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_l1_d_cache:1;
        /** reg_rst_en_l2_cache : R/W; bitpos: [16]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_l2_cache:1;
        /** reg_rst_en_l2_mem : R/W; bitpos: [17]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_l2_mem:1;
        /** reg_rst_en_l2memmon : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_l2memmon:1;
        /** reg_rst_en_tcmmon : R/W; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_tcmmon:1;
        /** reg_rst_en_pvt_apb : R/W; bitpos: [20]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_pvt_apb:1;
        /** reg_rst_en_gdma : R/W; bitpos: [21]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_gdma:1;
        /** reg_rst_en_mspi_axi : R/W; bitpos: [22]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_mspi_axi:1;
        /** reg_rst_en_dual_mspi_axi : R/W; bitpos: [23]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_dual_mspi_axi:1;
        /** reg_rst_en_mspi_apb : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_mspi_apb:1;
        /** reg_rst_en_dual_mspi_apb : R/W; bitpos: [25]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_dual_mspi_apb:1;
        /** reg_rst_en_dsi_brg : R/W; bitpos: [26]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_dsi_brg:1;
        /** reg_rst_en_csi_host : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_csi_host:1;
        /** reg_rst_en_csi_brg : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_csi_brg:1;
        /** reg_rst_en_isp : R/W; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_isp:1;
        /** reg_rst_en_jpeg : R/W; bitpos: [30]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_jpeg:1;
        /** reg_rst_en_dma2d : R/W; bitpos: [31]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_dma2d:1;
    };
    uint32_t val;
} hp_sys_clkrst_hp_rst_en0_reg_t;

