espressif/esp-idf/components/soc/esp32p4/include/soc/hp_sys_clkrst_struct.h
/** Type of hp_rst_en1 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_rst_en_ppa : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_ppa:1;
        /** reg_rst_en_ahb_pdma : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_ahb_pdma:1;
        /** reg_rst_en_axi_pdma : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_axi_pdma:1;
        /** reg_rst_en_iomux : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_iomux:1;
        /** reg_rst_en_padbist : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_padbist:1;
        /** reg_rst_en_stimer : R/W; bitpos: [5]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_stimer:1;
        /** reg_rst_en_timergrp0 : R/W; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_timergrp0:1;
        /** reg_rst_en_timergrp1 : R/W; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_timergrp1:1;
        /** reg_rst_en_uart0_core : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uart0_core:1;
        /** reg_rst_en_uart1_core : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uart1_core:1;
        /** reg_rst_en_uart2_core : R/W; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uart2_core:1;
        /** reg_rst_en_uart3_core : R/W; bitpos: [11]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uart3_core:1;
        /** reg_rst_en_uart4_core : R/W; bitpos: [12]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uart4_core:1;
        /** reg_rst_en_uart0_apb : R/W; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uart0_apb:1;
        /** reg_rst_en_uart1_apb : R/W; bitpos: [14]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uart1_apb:1;
        /** reg_rst_en_uart2_apb : R/W; bitpos: [15]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uart2_apb:1;
        /** reg_rst_en_uart3_apb : R/W; bitpos: [16]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uart3_apb:1;
        /** reg_rst_en_uart4_apb : R/W; bitpos: [17]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uart4_apb:1;
        /** reg_rst_en_uhci : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_uhci:1;
        /** reg_rst_en_i3cmst : R/W; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_i3cmst:1;
        /** reg_rst_en_i3cslv : R/W; bitpos: [20]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_i3cslv:1;
        /** reg_rst_en_i2c1 : R/W; bitpos: [21]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_i2c1:1;
        /** reg_rst_en_i2c0 : R/W; bitpos: [22]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_i2c0:1;
        /** reg_rst_en_rmt : R/W; bitpos: [23]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_rmt:1;
        /** reg_rst_en_pwm0 : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_pwm0:1;
        /** reg_rst_en_pwm1 : R/W; bitpos: [25]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_pwm1:1;
        /** reg_rst_en_can0 : R/W; bitpos: [26]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_can0:1;
        /** reg_rst_en_can1 : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_can1:1;
        /** reg_rst_en_can2 : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_can2:1;
        /** reg_rst_en_ledc : R/W; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_ledc:1;
        /** reg_rst_en_pcnt : R/W; bitpos: [30]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_pcnt:1;
        /** reg_rst_en_etm : R/W; bitpos: [31]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_etm:1;
    };
    uint32_t val;
} hp_sys_clkrst_hp_rst_en1_reg_t;

/** Type of hp_rst_en2 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_rst_en_intrmtx : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_intrmtx:1;
        /** reg_rst_en_parlio : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_parlio:1;
        /** reg_rst_en_parlio_rx : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_parlio_rx:1;
        /** reg_rst_en_parlio_tx : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_parlio_tx:1;
        /** reg_rst_en_i2s0_apb : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_i2s0_apb:1;
        /** reg_rst_en_i2s1_apb : R/W; bitpos: [5]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_i2s1_apb:1;
        /** reg_rst_en_i2s2_apb : R/W; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_i2s2_apb:1;
        /** reg_rst_en_spi2 : R/W; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_spi2:1;
        /** reg_rst_en_spi3 : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_spi3:1;
        /** reg_rst_en_lcdcam : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_lcdcam:1;
        /** reg_rst_en_adc : R/W; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_adc:1;
        /** reg_rst_en_bitsrambler : R/W; bitpos: [11]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_bitsrambler:1;
        /** reg_rst_en_bitsrambler_rx : R/W; bitpos: [12]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_bitsrambler_rx:1;
        /** reg_rst_en_bitsrambler_tx : R/W; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_bitsrambler_tx:1;
        /** reg_rst_en_crypto : R/W; bitpos: [14]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_crypto:1;
        /** reg_rst_en_sec : R/W; bitpos: [15]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_sec:1;
        /** reg_rst_en_aes : R/W; bitpos: [16]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_aes:1;
        /** reg_rst_en_ds : R/W; bitpos: [17]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_ds:1;
        /** reg_rst_en_sha : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_sha:1;
        /** reg_rst_en_hmac : R/W; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_hmac:1;
        /** reg_rst_en_ecdsa : R/W; bitpos: [20]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_ecdsa:1;
        /** reg_rst_en_rsa : R/W; bitpos: [21]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_rsa:1;
        /** reg_rst_en_ecc : R/W; bitpos: [22]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_ecc:1;
        /** reg_rst_en_km : R/W; bitpos: [23]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_km:1;
        /** reg_rst_en_h264 : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_rst_en_h264:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} hp_sys_clkrst_hp_rst_en2_reg_t;


/** Group: hp_force_norst */
/** Type of hp_force_norst0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_force_norst_core0 : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_core0:1;
        /** reg_force_norst_core1 : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_core1:1;
        /** reg_force_norst_coretrace0 : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_coretrace0:1;
        /** reg_force_norst_coretrace1 : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_coretrace1:1;
        /** reg_force_norst_l2memmon : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_l2memmon:1;
        /** reg_force_norst_tcmmon : R/W; bitpos: [5]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_tcmmon:1;
        /** reg_force_norst_gdma : R/W; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_gdma:1;
        /** reg_force_norst_mspi_axi : R/W; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_mspi_axi:1;
        /** reg_force_norst_dual_mspi_axi : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_dual_mspi_axi:1;
        /** reg_force_norst_mspi_apb : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_mspi_apb:1;
        /** reg_force_norst_dual_mspi_apb : R/W; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_dual_mspi_apb:1;
        /** reg_force_norst_dsi_brg : R/W; bitpos: [11]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_dsi_brg:1;
        /** reg_force_norst_csi_host : R/W; bitpos: [12]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_csi_host:1;
        /** reg_force_norst_csi_brg : R/W; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_csi_brg:1;
        /** reg_force_norst_isp : R/W; bitpos: [14]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_isp:1;
        /** reg_force_norst_jpeg : R/W; bitpos: [15]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_jpeg:1;
        /** reg_force_norst_dma2d : R/W; bitpos: [16]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_dma2d:1;
        /** reg_force_norst_ppa : R/W; bitpos: [17]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_ppa:1;
        /** reg_force_norst_ahb_pdma : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_ahb_pdma:1;
        /** reg_force_norst_axi_pdma : R/W; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_axi_pdma:1;
        /** reg_force_norst_iomux : R/W; bitpos: [20]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_iomux:1;
        /** reg_force_norst_padbist : R/W; bitpos: [21]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_padbist:1;
        /** reg_force_norst_stimer : R/W; bitpos: [22]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_stimer:1;
        /** reg_force_norst_timergrp0 : R/W; bitpos: [23]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_timergrp0:1;
        /** reg_force_norst_timergrp1 : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_timergrp1:1;
        /** reg_force_norst_uart0 : R/W; bitpos: [25]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_uart0:1;
        /** reg_force_norst_uart1 : R/W; bitpos: [26]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_uart1:1;
        /** reg_force_norst_uart2 : R/W; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_uart2:1;
        /** reg_force_norst_uart3 : R/W; bitpos: [28]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_uart3:1;
        /** reg_force_norst_uart4 : R/W; bitpos: [29]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_uart4:1;
        /** reg_force_norst_uhci : R/W; bitpos: [30]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_uhci:1;
        /** reg_force_norst_i3cmst : R/W; bitpos: [31]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_i3cmst:1;
    };
    uint32_t val;
} hp_sys_clkrst_hp_force_norst0_reg_t;

/** Type of hp_force_norst1 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_force_norst_i3cslv : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_i3cslv:1;
        /** reg_force_norst_i2c1 : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_i2c1:1;
        /** reg_force_norst_i2c0 : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_i2c0:1;
        /** reg_force_norst_rmt : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_rmt:1;
        /** reg_force_norst_pwm0 : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_pwm0:1;
        /** reg_force_norst_pwm1 : R/W; bitpos: [5]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_pwm1:1;
        /** reg_force_norst_can0 : R/W; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_can0:1;
        /** reg_force_norst_can1 : R/W; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_can1:1;
        /** reg_force_norst_can2 : R/W; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_can2:1;
        /** reg_force_norst_ledc : R/W; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_ledc:1;
        /** reg_force_norst_pcnt : R/W; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_pcnt:1;
        /** reg_force_norst_etm : R/W; bitpos: [11]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_etm:1;
        /** reg_force_norst_intrmtx : R/W; bitpos: [12]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_intrmtx:1;
        /** reg_force_norst_parlio : R/W; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_parlio:1;
        /** reg_force_norst_parlio_rx : R/W; bitpos: [14]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_parlio_rx:1;
        /** reg_force_norst_parlio_tx : R/W; bitpos: [15]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_parlio_tx:1;
        /** reg_force_norst_i2s0 : R/W; bitpos: [16]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_i2s0:1;
        /** reg_force_norst_i2s1 : R/W; bitpos: [17]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_i2s1:1;
        /** reg_force_norst_i2s2 : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_i2s2:1;
        /** reg_force_norst_spi2 : R/W; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_spi2:1;
        /** reg_force_norst_spi3 : R/W; bitpos: [20]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_spi3:1;
        /** reg_force_norst_lcdcam : R/W; bitpos: [21]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_lcdcam:1;
        /** reg_force_norst_adc : R/W; bitpos: [22]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_adc:1;
        /** reg_force_norst_bitsrambler : R/W; bitpos: [23]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_bitsrambler:1;
        /** reg_force_norst_bitsrambler_rx : R/W; bitpos: [24]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_bitsrambler_rx:1;
        /** reg_force_norst_bitsrambler_tx : R/W; bitpos: [25]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_bitsrambler_tx:1;
        /** reg_force_norst_h264 : R/W; bitpos: [26]; default: 0;
         *  Reserved
         */
        uint32_t reg_force_norst_h264:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_hp_force_norst1_reg_t;


