espressif/esp-idf/components/soc/esp32p4/include/soc/hp_sys_clkrst_struct.h
/** Group: hpwdt_core0_rst_ctrl */
/** Type of hpwdt_core0_rst_ctrl0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_hpcore0_stall_en : R/W; bitpos: [0]; default: 1;
         *  Reserved
         */
        uint32_t reg_hpcore0_stall_en:1;
        /** reg_hpcore0_stall_wait_num : R/W; bitpos: [8:1]; default: 8;
         *  Reserved
         */
        uint32_t reg_hpcore0_stall_wait_num:8;
        /** reg_wdt_hpcore0_rst_len : R/W; bitpos: [16:9]; default: 8;
         *  Reserved
         */
        uint32_t reg_wdt_hpcore0_rst_len:8;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_sys_clkrst_hpwdt_core0_rst_ctrl0_reg_t;


/** Group: hpwdt_core1_rst_ctrl */
/** Type of hpwdt_core1_rst_ctrl0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_hpcore1_stall_en : R/W; bitpos: [0]; default: 1;
         *  Reserved
         */
        uint32_t reg_hpcore1_stall_en:1;
        /** reg_hpcore1_stall_wait_num : R/W; bitpos: [8:1]; default: 8;
         *  Reserved
         */
        uint32_t reg_hpcore1_stall_wait_num:8;
        /** reg_wdt_hpcore1_rst_len : R/W; bitpos: [16:9]; default: 8;
         *  Reserved
         */
        uint32_t reg_wdt_hpcore1_rst_len:8;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_sys_clkrst_hpwdt_core1_rst_ctrl0_reg_t;


/** Group: cpu_src_freq */
/** Type of cpu_src_freq0 register
 *  CPU Source Frequency
 */
typedef union {
    struct {
        /** reg_cpu_src_freq : RO; bitpos: [31:0]; default: 0;
         *  cpu source clock frequency, step by 0.25MHz
         */
        uint32_t reg_cpu_src_freq:32;
    };
    uint32_t val;
} hp_sys_clkrst_cpu_src_freq0_reg_t;


/** Group: cpu_clk_status */
/** Type of cpu_clk_status0 register
 *  CPU Clock Status
 */
typedef union {
    struct {
        /** reg_asic_or_fpga : RO; bitpos: [0]; default: 0;
         *  0: ASIC mode, 1: FPGA mode
         */
        uint32_t reg_asic_or_fpga:1;
        /** reg_cpu_div_effect : RO; bitpos: [1]; default: 0;
         *  0: Divider bypass, 1: Divider takes effect
         */
        uint32_t reg_cpu_div_effect:1;
        /** reg_cpu_src_is_cpll : RO; bitpos: [2]; default: 0;
         *  0: CPU source isn't cpll_400m, 1: CPU Source is cll_400m
         */
        uint32_t reg_cpu_src_is_cpll:1;
        /** reg_cpu_div_num_cur : RO; bitpos: [10:3]; default: 0;
         *  cpu current div number
         */
        uint32_t reg_cpu_div_num_cur:8;
        /** reg_cpu_div_numerator_cur : RO; bitpos: [18:11]; default: 0;
         *  cpu current div numerator
         */
        uint32_t reg_cpu_div_numerator_cur:8;
        /** reg_cpu_div_denominator_cur : RO; bitpos: [26:19]; default: 0;
         *  cpu current div denominator
         */
        uint32_t reg_cpu_div_denominator_cur:8;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_sys_clkrst_cpu_clk_status0_reg_t;


/** Group: dbg_clk_ctrl */
/** Type of dbg_clk_ctrl0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_dbg_ch0_sel : R/W; bitpos: [7:0]; default: 255;
         *  Reserved
         */
        uint32_t reg_dbg_ch0_sel:8;
        /** reg_dbg_ch1_sel : R/W; bitpos: [15:8]; default: 255;
         *  Reserved
         */
        uint32_t reg_dbg_ch1_sel:8;
        /** reg_dbg_ch2_sel : R/W; bitpos: [23:16]; default: 255;
         *  Reserved
         */
        uint32_t reg_dbg_ch2_sel:8;
        /** reg_dbg_ch0_div_num : R/W; bitpos: [31:24]; default: 3;
         *  Reserved
         */
        uint32_t reg_dbg_ch0_div_num:8;
    };
    uint32_t val;
} hp_sys_clkrst_dbg_clk_ctrl0_reg_t;

/** Type of dbg_clk_ctrl1 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_dbg_ch1_div_num : R/W; bitpos: [7:0]; default: 3;
         *  Reserved
         */
        uint32_t reg_dbg_ch1_div_num:8;
        /** reg_dbg_ch2_div_num : R/W; bitpos: [15:8]; default: 3;
         *  Reserved
         */
        uint32_t reg_dbg_ch2_div_num:8;
        /** reg_dbg_ch0_en : R/W; bitpos: [16]; default: 0;
         *  Reserved
         */
        uint32_t reg_dbg_ch0_en:1;
        /** reg_dbg_ch1_en : R/W; bitpos: [17]; default: 0;
         *  Reserved
         */
        uint32_t reg_dbg_ch1_en:1;
        /** reg_dbg_ch2_en : R/W; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t reg_dbg_ch2_en:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} hp_sys_clkrst_dbg_clk_ctrl1_reg_t;


/** Group: hpcore_wdt_reset_source */
/** Type of hpcore_wdt_reset_source0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_hpcore0_wdt_reset_source_sel : R/W; bitpos: [0]; default: 0;
         *  1'b0: use wdt0 to reset hpcore0, 1'b1: use wdt1 to reset hpcore0
         */
        uint32_t reg_hpcore0_wdt_reset_source_sel:1;
        /** reg_hpcore1_wdt_reset_source_sel : R/W; bitpos: [1]; default: 1;
         *  1'b0: use wdt0 to reset hpcore1, 1'b1: use wdt1 to reset hpcore1
         */
        uint32_t reg_hpcore1_wdt_reset_source_sel:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_sys_clkrst_hpcore_wdt_reset_source0_reg_t;


typedef struct {
    volatile hp_sys_clkrst_clk_en0_reg_t clk_en0;
    volatile hp_sys_clkrst_root_clk_ctrl0_reg_t root_clk_ctrl0;
    volatile hp_sys_clkrst_root_clk_ctrl1_reg_t root_clk_ctrl1;
    volatile hp_sys_clkrst_root_clk_ctrl2_reg_t root_clk_ctrl2;
    volatile hp_sys_clkrst_root_clk_ctrl3_reg_t root_clk_ctrl3;
    volatile hp_sys_clkrst_soc_clk_ctrl0_reg_t soc_clk_ctrl0;
    volatile hp_sys_clkrst_soc_clk_ctrl1_reg_t soc_clk_ctrl1;
    volatile hp_sys_clkrst_soc_clk_ctrl2_reg_t soc_clk_ctrl2;
    volatile hp_sys_clkrst_soc_clk_ctrl3_reg_t soc_clk_ctrl3;
    volatile hp_sys_clkrst_ref_clk_ctrl0_reg_t ref_clk_ctrl0;
    volatile hp_sys_clkrst_ref_clk_ctrl1_reg_t ref_clk_ctrl1;
    volatile hp_sys_clkrst_ref_clk_ctrl2_reg_t ref_clk_ctrl2;
    volatile hp_sys_clkrst_peri_clk_ctrl00_reg_t peri_clk_ctrl00;
    volatile hp_sys_clkrst_peri_clk_ctrl01_reg_t peri_clk_ctrl01;
    volatile hp_sys_clkrst_peri_clk_ctrl02_reg_t peri_clk_ctrl02;
    volatile hp_sys_clkrst_peri_clk_ctrl03_reg_t peri_clk_ctrl03;
    volatile hp_sys_clkrst_peri_clk_ctrl10_reg_t peri_clk_ctrl10;
    volatile hp_sys_clkrst_peri_clk_ctrl11_reg_t peri_clk_ctrl11;
    volatile hp_sys_clkrst_peri_clk_ctrl12_reg_t peri_clk_ctrl12;
    volatile hp_sys_clkrst_peri_clk_ctrl13_reg_t peri_clk_ctrl13;
    volatile hp_sys_clkrst_peri_clk_ctrl14_reg_t peri_clk_ctrl14;
    volatile hp_sys_clkrst_peri_clk_ctrl15_reg_t peri_clk_ctrl15;
    volatile hp_sys_clkrst_peri_clk_ctrl16_reg_t peri_clk_ctrl16;
    volatile hp_sys_clkrst_peri_clk_ctrl17_reg_t peri_clk_ctrl17;
    volatile hp_sys_clkrst_peri_clk_ctrl18_reg_t peri_clk_ctrl18;
    volatile hp_sys_clkrst_peri_clk_ctrl19_reg_t peri_clk_ctrl19;
    volatile hp_sys_clkrst_peri_clk_ctrl110_reg_t peri_clk_ctrl110;
    volatile hp_sys_clkrst_peri_clk_ctrl111_reg_t peri_clk_ctrl111;
    volatile hp_sys_clkrst_peri_clk_ctrl112_reg_t peri_clk_ctrl112;
    volatile hp_sys_clkrst_peri_clk_ctrl113_reg_t peri_clk_ctrl113;
    volatile hp_sys_clkrst_peri_clk_ctrl114_reg_t peri_clk_ctrl114;
    volatile hp_sys_clkrst_peri_clk_ctrl115_reg_t peri_clk_ctrl115;
    volatile hp_sys_clkrst_peri_clk_ctrl116_reg_t peri_clk_ctrl116;
    volatile hp_sys_clkrst_peri_clk_ctrl117_reg_t peri_clk_ctrl117;
    volatile hp_sys_clkrst_peri_clk_ctrl118_reg_t peri_clk_ctrl118;
    volatile hp_sys_clkrst_peri_clk_ctrl119_reg_t peri_clk_ctrl119;
    volatile hp_sys_clkrst_peri_clk_ctrl120_reg_t peri_clk_ctrl120;
    volatile hp_sys_clkrst_peri_clk_ctrl20_reg_t peri_clk_ctrl20;
    volatile hp_sys_clkrst_peri_clk_ctrl21_reg_t peri_clk_ctrl21;
    volatile hp_sys_clkrst_peri_clk_ctrl22_reg_t peri_clk_ctrl22;
    volatile hp_sys_clkrst_peri_clk_ctrl23_reg_t peri_clk_ctrl23;
    volatile hp_sys_clkrst_peri_clk_ctrl24_reg_t peri_clk_ctrl24;
    volatile hp_sys_clkrst_peri_clk_ctrl25_reg_t peri_clk_ctrl25;
    volatile hp_sys_clkrst_peri_clk_ctrl26_reg_t peri_clk_ctrl26;
    volatile hp_sys_clkrst_peri_clk_ctrl27_reg_t peri_clk_ctrl27;
    volatile hp_sys_clkrst_clk_force_on_ctrl0_reg_t clk_force_on_ctrl0;
    volatile hp_sys_clkrst_dpa_ctrl0_reg_t dpa_ctrl0;
    volatile hp_sys_clkrst_ana_pll_ctrl0_reg_t ana_pll_ctrl0;
    volatile hp_sys_clkrst_hp_rst_en0_reg_t hp_rst_en0;
    volatile hp_sys_clkrst_hp_rst_en1_reg_t hp_rst_en1;
    volatile hp_sys_clkrst_hp_rst_en2_reg_t hp_rst_en2;
    volatile hp_sys_clkrst_hp_force_norst0_reg_t hp_force_norst0;
    volatile hp_sys_clkrst_hp_force_norst1_reg_t hp_force_norst1;
    volatile hp_sys_clkrst_hpwdt_core0_rst_ctrl0_reg_t hpwdt_core0_rst_ctrl0;
    volatile hp_sys_clkrst_hpwdt_core1_rst_ctrl0_reg_t hpwdt_core1_rst_ctrl0;
    volatile hp_sys_clkrst_cpu_src_freq0_reg_t cpu_src_freq0;
    volatile hp_sys_clkrst_cpu_clk_status0_reg_t cpu_clk_status0;
    volatile hp_sys_clkrst_dbg_clk_ctrl0_reg_t dbg_clk_ctrl0;
    volatile hp_sys_clkrst_dbg_clk_ctrl1_reg_t dbg_clk_ctrl1;
    volatile hp_sys_clkrst_hpcore_wdt_reset_source0_reg_t hpcore_wdt_reset_source0;
} hp_sys_clkrst_dev_t;

extern hp_sys_clkrst_dev_t HP_SYSTEM;


#ifndef __cplusplus
_Static_assert(sizeof(hp_sys_clkrst_dev_t) == 0xf0, "Invalid size of hp_sys_clkrst_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
